@lego963 So I'd guess this has nothing to do with `opentelekomcloud_lb_loadbalancer_v3` but rather the `opentelekomcloud_vpc_eip_v1` resource?

Because this still fails:
```hcl
resource "opentelekomcloud_vpc_v1" "this" {
  name = "nfelger-test-1"
  cidr = "10.0.0.0/20"
}

resource "opentelekomcloud_vpc_subnet_v1" "this" {
  name   = "nfelger-test-1"
  cidr   = cidrsubnet(opentelekomcloud_vpc_v1.this.cidr, 4, 1)
  vpc_id = opentelekomcloud_vpc_v1.this.id

  gateway_ip = cidrhost(cidrsubnet(opentelekomcloud_vpc_v1.this.cidr, 4, 1), 1)
}

resource "opentelekomcloud_vpc_eip_v1" "this" {
  bandwidth {
    charge_mode = "traffic"
    name        = "eip-prod-ops"
    share_type  = "PER"
    size        = 100
  }

  publicip {
    type = "5_gray"
  }
}
```

Like so:
```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # opentelekomcloud_vpc_eip_v1.this will be created
  + resource "opentelekomcloud_vpc_eip_v1" "this" {
      + id     = (known after apply)
      + region = (known after apply)

      + bandwidth {
          + charge_mode = "traffic"
          + name        = "eip-prod-ops"
          + share_type  = "PER"
          + size        = 100
        }

      + publicip {
          + ip_address = (known after apply)
          + port_id    = (known after apply)
          + type       = "5_gray"
        }
    }

  # opentelekomcloud_vpc_subnet_v1.this will be created
  + resource "opentelekomcloud_vpc_subnet_v1" "this" {
      + availability_zone = (known after apply)
      + cidr              = "10.0.1.0/24"
      + dhcp_enable       = true
      + dns_list          = (known after apply)
      + gateway_ip        = "10.0.1.1"
      + id                = (known after apply)
      + name              = "nfelger-test-1"
      + network_id        = (known after apply)
      + primary_dns       = (known after apply)
      + region            = (known after apply)
      + secondary_dns     = (known after apply)
      + subnet_id         = (known after apply)
      + vpc_id            = (known after apply)
    }

  # opentelekomcloud_vpc_v1.this will be created
  + resource "opentelekomcloud_vpc_v1" "this" {
      + cidr   = "10.0.0.0/20"
      + id     = (known after apply)
      + name   = "nfelger-test-1"
      + region = (known after apply)
      + shared = (known after apply)
      + status = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opentelekomcloud_vpc_v1.this: Creating...
opentelekomcloud_vpc_eip_v1.this: Creating...
opentelekomcloud_vpc_v1.this: Creation complete after 7s [id=5c0ecbe5-e0f0-43ce-a790-531615ecc567]
opentelekomcloud_vpc_subnet_v1.this: Creating...
opentelekomcloud_vpc_subnet_v1.this: Still creating... [10s elapsed]
opentelekomcloud_vpc_subnet_v1.this: Creation complete after 14s [id=f151edb2-e16c-4bd0-aad4-a30d13a1a3d9]
╷
│ Error: error allocating EIP: Bad request with: [POST https://vpc.eu-de.otc.t-systems.com/v1/6799a766398e4a93af289fab67f89d5f/publicips], error message: {"code":"VPC.0501","message":"PublicIp type is invalid."}
│ 
│   with opentelekomcloud_vpc_eip_v1.this,
│   on main.tf line 14, in resource "opentelekomcloud_vpc_eip_v1" "this":
│   14: resource "opentelekomcloud_vpc_eip_v1" "this" {
│ 
╵
```